# Problem 2

NIM : 16520251

Nama : Rofif Fairuz Hawary

Sesi/Kelas : 3.1/D

Tanggal : 13 Desember 2020

Deskripsi : Statistik dasar datascience

In [3]:
import pandas as pd

Menggunakan file dataset nilai_uas.csv sebagai variabel df

In [4]:
df = pd.read_csv("nilai_uas.csv")

# 1

mencari data nilai dalam df dengan nama mahasiswa "Tuan Mor"

In [5]:
df.loc[df["nama"] == "Tuan Mor"]

         nama fakultas  nilai_kal  nilai_fis  nilai_kim
391  Tuan Mor     STEI      94.76       67.5      24.82

# 2

mengambil data mahasiswa-mahasiswa yang memiliki nilai fisika tertinggi

In [11]:
# mengambil nilai max dari semua kolom
max = df.max()
# mengambil data mahasiswa-mahasiswa yang memiliki nilai fisika tertinggi
df[df["nilai_fis"] == max["nilai_fis"]]

             nama fakultas  nilai_kal  nilai_fis  nilai_kim
250  Cahyani Mora     FSRD      100.0      100.0      79.55

# 3

mengambil 10 mahasiswa dengan nilai terbesar dilihat dari nilai kimia

In [12]:
# mendeclare kim_max sebagai data baru dengan urutan nilai kimia dari terbesar hingga terkecil
kim_max = df.sort_values(["nilai_kim"], ascending=[0])
# mengambil 10 data pertama dari kim_max
kim_max[:10]

                  nama fakultas  nilai_kal  nilai_fis  nilai_kim
3074  Muhammadi Jumhur     FTSL      35.56      39.49      88.38
640         Grace Yoga     FTTM      42.24      48.16      86.26
18      Maria Manurung     FTMD      56.86      58.83      86.26
3469        Dhiya Wafa      SBM      68.89      76.51      85.73
661          Rasyid FH     FSRD      77.78      77.89      85.26
1884       Sukma Ulhaq     FITB      43.97      44.91      85.26
780       Rizam Rayhan     FSRD      72.15      71.38      85.07
283   WIJAYANTI Amadio    SITHS      61.96      57.73      85.07
3017     Jevon Tangguh    FMIPA      50.42      48.15      84.92
2487       Ediva zilva    SITHR      65.04      69.31      84.87

# 4

mencari banyaknya mahasiswa yang memiliki nilai kalkulus di bawah 50

In [9]:
len(df[df["nilai_kal"] <50])

1549

# 5

mencari jumlah mahasiswa FMIPA

In [10]:
len(df[df["fakultas"] == "FMIPA"])

396